mkj/imxrt-pacs/svd/MIMXRT1015.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CSU</name>
      <description>CSU registers</description>
      <groupName>CSU</groupName>
      <prependToName>CSU_</prependToName>
      <baseAddress>0x400DC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x35C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CSU</name>
        <value>49</value>
      </interrupt>
      <registers>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
          <name>CSL%s</name>
          <description>Config security level register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x330033</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUR_S2</name>
              <description>Secure user read access control for the second slave</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUR_S2_0</name>
                  <description>The secure user read access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUR_S2_1</name>
                  <description>The secure user read access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSR_S2</name>
              <description>Secure supervisor read access control for the second slave</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSR_S2_0</name>
                  <description>The secure supervisor read access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSR_S2_1</name>
                  <description>The secure supervisor read access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUR_S2</name>
              <description>Non-secure user read access control for the second slave</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUR_S2_0</name>
                  <description>The non-secure user read access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUR_S2_1</name>
                  <description>The non-secure user read access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSR_S2</name>
              <description>Non-secure supervisor read access control for the second slave</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSR_S2_0</name>
                  <description>The non-secure supervisor read access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSR_S2_1</name>
                  <description>The non-secure supervisor read access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUW_S2</name>
              <description>Secure user write access control for the second slave</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUW_S2_0</name>
                  <description>The secure user write access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUW_S2_1</name>
                  <description>The secure user write access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSW_S2</name>
              <description>Secure supervisor write access control for the second slave</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSW_S2_0</name>
                  <description>The secure supervisor write access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSW_S2_1</name>
                  <description>The secure supervisor write access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUW_S2</name>
              <description>Non-secure user write access control for the second slave</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUW_S2_0</name>
                  <description>The non-secure user write access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUW_S2_1</name>
                  <description>The non-secure user write access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSW_S2</name>
              <description>Non-secure supervisor write access control for the second slave</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSW_S2_0</name>
                  <description>The non-secure supervisor write access is disabled for the second slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSW_S2_1</name>
                  <description>The non-secure supervisor write access is enabled for the second slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_S2</name>
              <description>The lock bit corresponding to the second slave. It is written by the secure software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_S2_0</name>
                  <description>Not locked. Bits 7-0 can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_S2_1</name>
                  <description>Bits 7-0 are locked and cannot be written by the software</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUR_S1</name>
              <description>Secure user read access control for the first slave</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUR_S1_0</name>
                  <description>The secure user read access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUR_S1_1</name>
                  <description>The secure user read access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSR_S1</name>
              <description>Secure supervisor read access control for the first slave</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSR_S1_0</name>
                  <description>The secure supervisor read access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSR_S1_1</name>
                  <description>The secure supervisor read access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUR_S1</name>
              <description>Non-secure user read access control for the first slave</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUR_S1_0</name>
                  <description>The non-secure user read access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUR_S1_1</name>
                  <description>The non-secure user read access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSR_S1</name>
              <description>Non-secure supervisor read access control for the first slave</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSR_S1_0</name>
                  <description>The non-secure supervisor read access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSR_S1_1</name>
                  <description>The non-secure supervisor read access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUW_S1</name>
              <description>Secure user write access control for the first slave</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUW_S1_0</name>
                  <description>The secure user write access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUW_S1_1</name>
                  <description>The secure user write access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSW_S1</name>
              <description>Secure supervisor write access control for the first slave</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSW_S1_0</name>
                  <description>The secure supervisor write access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSW_S1_1</name>
                  <description>The secure supervisor write access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUW_S1</name>
              <description>Non-secure user write access control for the first slave</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUW_S1_0</name>
                  <description>The non-secure user write access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUW_S1_1</name>
                  <description>The non-secure user write access is enabled for the first slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSW_S1</name>
              <description>Non-secure supervisor write access control for the first slave</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSW_S1_0</name>
                  <description>The non-secure supervisor write access is disabled for the first slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSW_S1_1</name>
                  <description>The non-secure supervisor write access is enabled for the first slave</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_S1</name>
              <description>The lock bit corresponding to the first slave. It is written by the secure software.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_S1_0</name>
                  <description>Not locked. The bits 16-23 can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_S1_1</name>
                  <description>The bits 16-23 are locked and can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
