mkj/imxrt-pacs/svd/MIMXRT1015.svd
        <register>
          <name>CIMR</name>
          <description>CCM Interrupt Mask Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK_LRF_PLL</name>
              <description>mask interrupt generation due to lrf of PLLs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_LRF_PLL_0</name>
                  <description>don't mask interrupt due to lrf of PLLs - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_LRF_PLL_1</name>
                  <description>mask interrupt due to lrf of PLLs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_COSC_READY</name>
              <description>mask interrupt generation due to on board oscillator ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_COSC_READY_0</name>
                  <description>don't mask interrupt due to on board oscillator ready - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_COSC_READY_1</name>
                  <description>mask interrupt due to on board oscillator ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_SEMC_PODF_LOADED</name>
              <description>mask interrupt generation due to frequency change of semc_podf</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_SEMC_PODF_LOADED_0</name>
                  <description>don't mask interrupt due to frequency change of semc_podf - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_SEMC_PODF_LOADED_1</name>
                  <description>mask interrupt due to frequency change of semc_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_PERIPH2_CLK_SEL_LOADED</name>
              <description>mask interrupt generation due to update of periph2_clk_sel.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_PERIPH2_CLK_SEL_LOADED_0</name>
                  <description>don't mask interrupt due to update of periph2_clk_sel - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_PERIPH2_CLK_SEL_LOADED_1</name>
                  <description>mask interrupt due to update of periph2_clk_sel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_AHB_PODF_LOADED</name>
              <description>mask interrupt generation due to frequency change of ahb_podf</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_AHB_PODF_LOADED_0</name>
                  <description>don't mask interrupt due to frequency change of ahb_podf - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_AHB_PODF_LOADED_1</name>
                  <description>mask interrupt due to frequency change of ahb_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_PERIPH_CLK_SEL_LOADED</name>
              <description>mask interrupt generation due to update of periph_clk_sel.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_PERIPH_CLK_SEL_LOADED_0</name>
                  <description>don't mask interrupt due to update of periph_clk_sel - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_PERIPH_CLK_SEL_LOADED_1</name>
                  <description>mask interrupt due to update of periph_clk_sel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_PODF_LOADED</name>
              <description>mask interrupt generation due to frequency change of arm_podf</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_0</name>
                  <description>don't mask interrupt due to frequency change of arm_podf - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_1</name>
                  <description>mask interrupt due to frequency change of arm_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCOSR</name>
          <description>CCM Clock Output Source Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKO1_SEL</name>
              <description>Selection of the clock to be generated on CCM_CLKO1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO1_SEL_0</name>
                  <description>pll3_sw_clk (divided by 2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_SEL_1</name>
                  <description>PLL2 (divided by 2)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_SEL_2</name>
                  <description>ENET PLL (divided by 2)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_SEL_11</name>
                  <description>ahb_clk_root</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_SEL_12</name>
                  <description>ipg_clk_root</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_SEL_13</name>
                  <description>perclk_root</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_SEL_15</name>
                  <description>pll4_main_clk</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO1_DIV</name>
              <description>Setting the divider of CCM_CLKO1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO1_DIV_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_DIV_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO1_EN</name>
              <description>Enable of CCM_CLKO1 clock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO1_EN_0</name>
                  <description>CCM_CLKO1 disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO1_EN_1</name>
                  <description>CCM_CLKO1 enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_OUT_SEL</name>
              <description>CCM_CLKO1 output to reflect CCM_CLKO1 or CCM_CLKO2 clocks</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_OUT_SEL_0</name>
                  <description>CCM_CLKO1 output drives CCM_CLKO1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OUT_SEL_1</name>
                  <description>CCM_CLKO1 output drives CCM_CLKO2 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO2_SEL</name>
              <description>Selection of the clock to be generated on CCM_CLKO2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO2_SEL_6</name>
                  <description>lpi2c_clk_root</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_14</name>
                  <description>osc_clk</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_16</name>
                  <description>lpspi_clk_root</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_18</name>
                  <description>sai1_clk_root</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_19</name>
                  <description>sai2_clk_root</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_20</name>
                  <description>sai3_clk_root</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_22</name>
                  <description>trace_clk_root</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_27</name>
                  <description>flexspi_clk_root</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_28</name>
                  <description>uart_clk_root</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_SEL_29</name>
                  <description>spdif0_clk_root</description>
                  <value>0x1D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO2_DIV</name>
              <description>Setting the divider of CCM_CLKO2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO2_DIV_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_DIV_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO2_EN</name>
              <description>Enable of CCM_CLKO2 clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO2_EN_0</name>
                  <description>CCM_CLKO2 disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO2_EN_1</name>
                  <description>CCM_CLKO2 enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CGPR</name>
          <description>CCM General Purpose Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFE62</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMIC_DELAY_SCALER</name>
              <description>Defines clock dividion of clock for stby_count (pmic delay counter)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMIC_DELAY_SCALER_0</name>
                  <description>clock is not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_DELAY_SCALER_1</name>
                  <description>clock is divided /8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFUSE_PROG_SUPPLY_GATE</name>
              <description>Defines the value of the output signal cgpr_dout[4]. Gate of program supply for efuse programing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EFUSE_PROG_SUPPLY_GATE_0</name>
                  <description>fuse programing supply voltage is gated off to the efuse module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFUSE_PROG_SUPPLY_GATE_1</name>
                  <description>allow fuse programing.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYS_MEM_DS_CTRL</name>
              <description>System memory DS control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYS_MEM_DS_CTRL_0</name>
                  <description>Disable memory DS mode always</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_MEM_DS_CTRL_1</name>
                  <description>Enable memory (outside Arm platform) DS mode when system STOP and PLL are disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_MEM_DS_CTRL_2</name>
                  <description>enable memory (outside Arm platform) DS mode when system is in STOP mode</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPL</name>
              <description>Fast PLL enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FPL_0</name>
                  <description>Engage PLL enable default way.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPL_1</name>
                  <description>Engage PLL enable 3 CKIL clocks earlier at exiting low power mode (STOP). Should be used only if 24MHz OSC was active in low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_MEM_CLK_LPM</name>
              <description>Control for the Deep Sleep signal to the Arm Platform memories with additional control logic based on the Arm WFI signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_MEM_CLK_LPM_0</name>
                  <description>Disable the clock to the Arm platform memories when entering Low Power Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_MEM_CLK_LPM_1</name>
                  <description>Keep the clocks to the Arm platform memories enabled only if an interrupt is pending when entering Low Power Modes (WAIT and STOP without power gating)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
