mkj/imxrt-pacs/svd/MIMXRT1015.svd
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_B1_12</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_B1_12 SW MUX Control Register</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: USB_OTG1_OC of instance: usb</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: ACMP_OUT00 of instance: acmp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO03 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO1_IO28 of instance: gpio1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXPWM1_PWMA03 of instance: flexpwm1</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_B1_12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_B1_13</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_B1_13 SW MUX Control Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C1_HREQ of instance: lpi2c1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: ACMP_OUT01 of instance: acmp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO02 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO1_IO29 of instance: gpio1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXPWM1_PWMB03 of instance: flexpwm1</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_B1_13</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_B1_14</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_B1_14 SW MUX Control Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C1_SCL of instance: lpi2c1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: ACMP_OUT02 of instance: acmp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO01 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO1_IO30 of instance: gpio1</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_B1_14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_B1_15</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_B1_15 SW MUX Control Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C1_SDA of instance: lpi2c1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: ACMP_OUT03 of instance: acmp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO00 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO1_IO31 of instance: gpio1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: CCM_DI0_EXT_CLK of instance: ccm</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_B1_15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_00 SW MUX Control Register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI_B_DATA03 of instance: flexspi</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_XBAR_INOUT10 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO20 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_01 SW MUX Control Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI_B_SCLK of instance: flexspi</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI_A_SS1_B of instance: flexspi</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO21 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_02 SW MUX Control Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI_B_DATA00 of instance: flexspi</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO22 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: CCM_CLKO1 of instance: ccm</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_03 SW MUX Control Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI_B_DATA02 of instance: flexspi</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO23 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: CCM_CLKO2 of instance: ccm</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_04 SW MUX Control Register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI_B_DATA01 of instance: flexspi</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: EWM_EWM_OUT_B of instance: ewm</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO24 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: CCM_WAIT of instance: ccm</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
