mkj/imxrt-pacs/svd/MIMXRT1015.svd
        <register>
          <name>SAI2_IPG_CLK_SAI_MCLK_SELECT_INPUT_2</name>
          <description>SAI2_IPG_CLK_SAI_MCLK_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_16_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_16 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI2_IPP_IND_SAI_RXBCLK_SELECT_INPUT</name>
          <description>SAI2_IPP_IND_SAI_RXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_09_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_09 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI2_IPP_IND_SAI_RXDATA_SELECT_INPUT_0</name>
          <description>SAI2_IPP_IND_SAI_RXDATA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_08_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_08 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI2_IPP_IND_SAI_RXSYNC_SELECT_INPUT</name>
          <description>SAI2_IPP_IND_SAI_RXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_07_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_07 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI2_IPP_IND_SAI_TXBCLK_SELECT_INPUT</name>
          <description>SAI2_IPP_IND_SAI_TXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_04_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_04 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI2_IPP_IND_SAI_TXSYNC_SELECT_INPUT</name>
          <description>SAI2_IPP_IND_SAI_TXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_05_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_05 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPG_CLK_SAI_MCLK_SELECT_INPUT_2</name>
          <description>SAI3_IPG_CLK_SAI_MCLK_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x46C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_05_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_05 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_17_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_17 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_RXBCLK_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_RXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_09_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_09 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_RXDATA_SELECT_INPUT_0</name>
          <description>SAI3_IPP_IND_SAI_RXDATA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_11_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_11 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_10_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_10 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x47C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_06_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_06 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_33_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_33 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_TXSYNC_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_TXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_07_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_07 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_34_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_34 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIF_SPDIF_IN1_SELECT_INPUT</name>
          <description>SPDIF_SPDIF_IN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_05_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_05 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_IPP_IND_OTG_OC_SELECT_INPUT</name>
          <description>USB_IPP_IND_OTG_OC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x48C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_03_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_B0_03 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_12_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_B1_12 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_14</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_14 DAISY Register</description>
          <addressOffset>0x4A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_15</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_15 DAISY Register</description>
          <addressOffset>0x4A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_16</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_16 DAISY Register</description>
          <addressOffset>0x4A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_18_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_18 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_17</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_17 DAISY Register</description>
          <addressOffset>0x4AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_19_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_19 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_10</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_10 DAISY Register</description>
          <addressOffset>0x4B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_00_ALT3</name>
                  <description>Selecting Pad: GPIO_SD_B1_00 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_12</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_12 DAISY Register</description>
          <addressOffset>0x4B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_13</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_13 DAISY Register</description>
          <addressOffset>0x4B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_18</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_18 DAISY Register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBAR1_XBAR_IN_SELECT_INPUT_19</name>
          <description>XBAR1_XBAR_IN_SELECT_INPUT_19 DAISY Register</description>
          <addressOffset>0x4C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
